; domain
(define (domain furniture-assembly)
	(:requirements :strips :typing)
	(:types
		tool tool-part - object
		table-top table-leg chair-base chair-leg chair-seat shelf-frame shelf-box desk-plane desk-drawer - tool
		handle-part action-part - tool-part
		gripper
	)

	(:predicates
		(on ?t1 - tool ?t2 - tool)
		(on-floor ?t - tool)
		(clear ?t - tool)
		(empty ?g - gripper)
		(in-hand ?g - gripper ?t - tool)
		(screwed-into ?t - tool ?s - tool)
        (connected-to ?t - tool ?s - tool)
		(part-of ?tp - tool-part ?t - tool)
		(affords-picking ?tp - handle-part)
		(affords-screwing ?tp - action-part)
        (affords-connecting ?tp - action-part)
		(affords-hammering ?tp - action-part)
		(affords-turning-on ?tp - action-part)
		(affords-turning-off ?tp - action-part)
		(affords-placing ?t - tool)
		(affords-screwing-into ?s - tool ?tp - tool-part ?t - tool)
        (affords-connecting-to ?s - tool ?tp - tool-part ?t - tool)
	)

	(:action pick-up-from-tool
		:parameters (?g - gripper ?tp - handle-part ?t - tool ?s - tool)
		:precondition (and (clear ?t) (empty ?g) (on ?t ?s) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (clear ?s) (not (clear ?t)) (not (empty ?g)) (not (on ?t ?s)))
	)

	(:action pick-up-from-floor
		:parameters (?g - gripper ?tp - handle-part ?t - tool)
		:precondition (and (clear ?t) (empty ?g) (on-floor ?t) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (not (clear ?t)) (not (empty ?g)) (not (on-floor ?t)))
	)

	(:action put-on-floor
		:parameters (?g - gripper ?t - tool)
		:precondition (and (in-hand ?g ?t) (affords-placing ?t))
		:effect (and (on-floor ?t) (clear ?t) (empty ?g) (not (in-hand ?g ?t)))
	)

	(:action screw-into
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-screwing ?tp) (part-of ?th ?tt) (affords-screwing-into ?tl ?th ?tt))
		:effect (and (screwed-into ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)

    (:action connect-to
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-connecting ?tp) (part-of ?th ?tt) (affords-connecting-to ?tl ?th ?tt))
		:effect (and (connected-to ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)
)

; problem
(define (problem table-assembly-full)
	(:domain furniture-assembly)
; todo: add a conditional connection (leg2 and seat can connect only if leg1 is already connected to seat. don't know how to express this in domain.pddl)
	(:objects
		seat - chair-seat
		leg1 leg2 - chair-leg
		leg1-base leg2-base seat-base - handle-part
		leg1-connect leg2-connect - action-part
		seat-connector1 seat-connector2 - tool-part
		robot-gripper - gripper
	)

	(:init
		(on-floor seat)
		(on-floor leg1)
		(on-floor leg2)

		(clear seat)
		(clear leg1)
		(clear leg2)

		(empty robot-gripper)

		(part-of seat-base seat)
		(part-of leg1-base leg1)
		(part-of leg2-base leg2)

		(part-of leg1-connect leg1)
        (part-of leg2-connect leg2)
        (part-of seat-connector1 seat)
        (part-of seat-connector2 seat)

		(affords-picking seat-base)
		(affords-picking leg1-base)
		(affords-picking leg2-base)

		(affords-connecting leg1-connect)
        (affords-connecting leg2-connect)
		(affords-connecting-to leg1 seat-connector1 seat)
        (affords-connecting-to leg2 seat-connector2 seat)
	)

	(:goal (and (connected-to leg1 seat)
				(connected-to leg2 seat)
		   	)
	)
)

; plan
1. (pick-up-from-floor robot-gripper leg1-base leg1)
   deleted: (clear leg1) (empty robot-gripper) (on-floor leg1)
   added: (in-hand robot-gripper leg1)
   goals met: 0 of 2
2. (connect-to robot-gripper leg1-connect leg1 seat-connector1 seat)
   deleted: (in-hand robot-gripper leg1)
   added: (connected-to leg1 seat) (clear leg1) (empty robot-gripper)
   goals met: 1 of 2
3. (pick-up-from-floor robot-gripper leg2-base leg2)
   deleted: (clear leg2) (empty robot-gripper) (on-floor leg2)
   added: (in-hand robot-gripper leg2)
   goals met: 1 of 2
4. (connect-to robot-gripper leg2-connect leg2 seat-connector2 seat)
   deleted: (in-hand robot-gripper leg2)
   added: (connected-to leg2 seat) (clear leg2) (empty robot-gripper)
   goals met: 2 of 2
